export const BEM = {
	title: "БЭМ",
	number: "5",
	difficultyLevel: "2",
	id: "BEM",
	list: [
		{
			question: "Расшифруйте аббревиатуру БЭМ:",
			answer: "Блок элемент модификатор"
		},
		{
			question: "Независимый компонент страницы это:",
			answer: "Блок"
		},
		{
			question: "На какой вопрос отвечает “Блок”",
			answer: "что это?"
		},
		{
			question: "Что не стоит давать блоку в стилях?",
			answer: "Внешние отступы"
		},
		{
			question: "Блоки можно вкладывать друг в друг? Допустима любая вложенность? ",
			answer: "Да"
		},
		{
			question: "Как вы напишите название выложенного блока1 в блок2?",
			answer: "блок2- блока1"
		},
		{
			question: "Элемент – всегда часть чего? ",
			answer: "блока"
		},
		{
			question: "Элементы можно вкладывать друг в друга?",
			answer: "Да"
		},
		{
			question: "Моно прописывать иерархию, то есть имя должно быть «блок__элемент» и не можент быть «элемент__ элемент»?",
			answer: "Нет"
		},
		{
			question: "Как вы напишите название элемента вложенного в блок?",
			answer: "Блок_ _Элемент"
		},
		{
			question: "Что отвечает на вопросы Какой? Как выглядит? Как себя ведет? Состояние?",
			answer: "Модификатор"
		},
		{
			question: "Как вы напишите блок с модификатором? ",
			answer: "Блок_модификатор"
		},
		{
			question: "Имя Класса__ИмяЭлемента_модификатор; Верно? ",
			answer: "да"
		},
		{
			question: "Имя Класса__ИмяЭлемента_модификатор; Верно?",
			answer: "да"
		},
		{
			question: "Блок_ _Элемент Верно?",
			answer: "да"
		},
		{
			question: "Блок_ _Блок Верно?",
			answer: "нет"
		},
		{
			question: "элемент__ элемент Верно?",
			answer: "нет"
		},
	]
}